OskurElAlbum/Robot-Hexapode/Hexapode_STM32F7/Core/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_ETH_Init();
  MX_ADC1_Init();
  MX_TIM4_Init();
  MX_USART2_UART_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_Receive_IT(&huart3,rx_data,20);
  HAL_UART_Receive_IT(&huart2,rx_data2,200);
  HAL_ADC_Start_DMA(&hadc1,(uint32_t *)rawValues,2);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
  dataRdyIntReceived = 0;
  MEMS_Init();
  

  void LedManagement_PWMfirstTest(void)
  {
  for(uint8_t i=0;i<255;i++)
    {
      __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_2, i);
      HAL_Delay(5);
    }

    for(uint8_t i=255;i>0;i--)
    {
      __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_2, i);
      HAL_Delay(5);
    }
  }

void reset_all_leds(Led_Neopixel* leds, uint16_t number_leds)
{
  for (int i = 0; i < number_leds; i++)
  {
    for(int j = 0; j < 8; j++)
    {
      (leds + i)->uRedPixel[j] = LED_LOGICAL_ZERO;
      (leds + i)->uGreenPixel[j] = LED_LOGICAL_ZERO;
      (leds + i)->uBluePixel[j] = LED_LOGICAL_ZERO;
    }
  }
}

void set_all_leds(Led_Neopixel* leds, uint16_t number_leds)
{
  for (int i = 0; i < number_leds; i++)
  {
    for(int j = 0; j < 8; j++)
    {
      (leds + i)->uRedPixel[j] = LED_LOGICAL_ONE;
      (leds + i)->uGreenPixel[j] = LED_LOGICAL_ONE;
      (leds + i)->uBluePixel[j] = LED_LOGICAL_ONE;
    }
  }
}

void set_specific_led(Led_Neopixel* leds, uint16_t led_position,Led_RGB color)
{
  // 7 - j is necessary to reverse the order of the bits
  for(int j = 0; j < 8; j++)
  {
    if(color.RedColor & 0x1 <<j)
    {
      (leds + led_position) ->uRedPixel[7-j]=LED_LOGICAL_ONE;
    }
    else
    {
      (leds + led_position) ->uRedPixel[7-j]=LED_LOGICAL_ZERO;
    }
    if(color.GreenColor & 0x1 <<j)
    {
      (leds + led_position) ->uGreenPixel[7-j]=LED_LOGICAL_ONE;
    }
    else
    {
      (leds + led_position) ->uGreenPixel[7-j]=LED_LOGICAL_ZERO;
    }
    if(color.BlueColor & 0x1 <<j)
    {
      (leds + led_position) ->uBluePixel[7-j]=LED_LOGICAL_ONE;
    }
    else
    {
      (leds + led_position) ->uBluePixel[7-j]=LED_LOGICAL_ZERO;
    }
  }
}

void set_patern_led(Led_Neopixel* leds,Led_RGB *pattern,uint16_t number_leds)
{
  for(int i=0;i<number_leds;i++)
  {
    set_specific_led(leds,i,*(pattern+i));
  }
}

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int bjr = 5;
  while (1)
  {
    // bjr = incrementerDe10(bjr);
    // printf("Valeur avant l'incrémentation : %d\n", bjr);

  //if (dataRdyIntReceived != 0) 
  //{
    dataRdyIntReceived = 0;
    LSM6DSL_Axes_t acc_axes;
    LSM6DSL_ACC_GetAxes(&MotionSensor, &acc_axes);
    // printf("% 5d, % 5d, % 5d\r\n",  (int) acc_axes.x, (int) acc_axes.y, );
    sprintf(messageAcc,"La valeur de l'acceleration est %d,%d et %d \r\n",(int) acc_axes.x,(int) acc_axes.y,(int) acc_axes.z);
    HAL_UART_Transmit(&huart3,(uint8_t *)messageAcc,strlen(message),HAL_MAX_DELAY);
  //}

  // Allumer la LED
  // HAL_GPIO_WritePin(GPIOB, LD1_Pin, GPIO_PIN_SET);
  // // HAL_UART_Transmit(&huart3,tx_buffer,30,20);
  // HAL_Delay(500); // Attendre 500 ms

  // // Éteindre la LED
  // HAL_GPIO_WritePin(GPIOB, LD1_Pin, GPIO_PIN_RESET);
  // HAL_Delay(500); // Attendre 500 ms
  
  //lecture 1 entrée ADC
    // HAL_ADC_Start(&hadc1);
    // HAL_ADC_PollForConversion(&hadc1, 20);
    // Voltage_potentiometer =HAL_ADC_GetValue(&hadc1);
    // sprintf(message," La tension est de %d \r\n",Voltage_potentiometer);
    // HAL_UART_Transmit(&huart3,(uint8_t)message,strlen(message),HAL_MAX_DELAY);
    // HAL_Delay(500);

    // lecture 2 entrées ADC en DMA
       if(convcomplete==1)
      {
        pot1=(uint16_t)rawValues[0];
        pot2=(uint16_t)rawValues[1];
        convcomplete=0;
        HAL_ADC_Start_DMA(&hadc1,(uint32_t *)rawValues,2);
      }
      
      // HAL_UART_Transmit(&huart2,tx_buffer,strlen(tx_buffer),HAL_MAX_DELAY);
      // HAL_Delay(1000);

        sprintf(message,"La valeur de pot1 est %d et la valeur de pot2 est %d \r\n",pot1,pot2);
        HAL_UART_Transmit(&huart3,(uint8_t *)message,strlen(message),HAL_MAX_DELAY);
        HAL_Delay(100);

    LedManagement_PWMfirstTest();

    // for(uint8_t ibcl=0;ibcl<27;ibcl++)
    // {
    //   __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_3, ibcl);
    //   HAL_Delay(100);
    // }
    // for(uint8_t ibcl=27;ibcl>0;ibcl--)
    // {
    //   __HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_3, ibcl);
    //   HAL_Delay(100);
    // }

    // //Allumer et éteindre toutes les leds
    // reset_all_leds(leds, NUMBER_OF_LEDS);
    // HAL_TIM_PWM_Start_DMA(&htim3, TIM_CHANNEL_3, (uint32_t *)leds, NUMBER_OF_LEDS *17 +17);
    // HAL_Delay(200);
    // set_all_leds(leds, NUMBER_OF_LEDS);
    // HAL_TIM_PWM_Start_DMA(&htim3, TIM_CHANNEL_3, (uint32_t *)leds, NUMBER_OF_LEDS *17 +17);
    // HAL_Delay(200);

    //Allumer une led spécifique
    // set_specific_led(leds,led_pos_counter,black_color);
    // led_pos_counter++;
    // if(led_pos_counter==NUMBER_OF_LEDS)
    // {
    //   led_pos_counter=0;
    // }
    // set_specific_led(leds,led_pos_counter,red_color);
    // HAL_TIM_PWM_Start_DMA(&htim3, TIM_CHANNEL_3, (uint32_t *)leds, NUMBER_OF_LEDS *17 +17);
    // HAL_Delay(100);

    //patern de circulation
    // led_pos_counter++;
    // if(led_pos_counter==NUMBER_OF_LEDS)
    // {
    //   led_pos_counter=0;
    // }
    // temp_neo_pixel = circular_pattern_led[led_pos_counter+NUMBER_OF_LEDS];
    // circular_pattern_led[led_pos_counter+NUMBER_OF_LEDS] = circular_pattern_led[2*led_pos_counter];
    // HAL_TIM_PWM_Start_DMA(&htim3, TIM_CHANNEL_3, (uint32_t *)&circular_pattern_led, NUMBER_OF_LEDS);
    // HAL_Delay(100);
    // circular_pattern_led[led_pos_counter+NUMBER_OF_LEDS] = temp_neo_pixel;

    /* USER CODE END WHILE */

